Revit 2026 API

# CircuitNamingSchemeCreate Method

---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static CircuitNamingScheme Create(
	Document document,
	string name,
	IList<TableCellCombinedParameterData> data
)
```
```vb
Public Shared Function Create (
	document As Document,
	name As String,
	data As IList(Of TableCellCombinedParameterData)
) As CircuitNamingScheme
```
```cpp
public:
static CircuitNamingScheme^ Create(
	Document^ document,
	String^ name,
	IList<TableCellCombinedParameterData^>^ data
)
```
```fsharp
static member Create :
        document : Document *
        name : string *
        data : IList<TableCellCombinedParameterData> -> CircuitNamingScheme
```

#### Parameters

document Document

name String

data IListTableCellCombinedParameterData

#### Return Value

CircuitNamingScheme

#### Reference

CircuitNamingScheme Class

Autodesk.Revit.DB.Electrical Namespace